package ensyu7_5;

/*
 *  クラス名 :Ensyu7_5
 *  概要     :演習問題7-5の解答クラスです。
 *  作成者   :山川勇輝
 *  作成日   :2023.04.14
 */
public class Ensyu7_5 {
	/*
	 * 関数名           :hello
	 * メソッドの説明   :「こんにちは。」と表示して改行する
	 *                   ※この問題では教本で関数名が指定されている
	 * パラメータの説明 :なし
	 * 返り値           :なし
	 * 作成者           :山川勇輝
	 * 作成日           :2023.04.14
	 */
	static void hello() {
		// こんにちは。と表示して改行する
		System.out.println("こんにちは。");
	}
	
	
	/*
	 * 関数名           :main
	 * メソッドの説明   :メソッドhelloを呼び出す
	 * パラメータの説明 :なし
	 * 返り値           :なし
	 * 作成者           :山川勇輝
	 * 作成日           :2023.04.14
	 */
	public static void main(String[] args) {
		// メソッドhelloを実行する
		hello();
	}
}
